Revit 2024 API
UnitTypeId.BritishThermalUnits Property
 British thermal units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId BritishThermalUnits { get; }
Visual Basic
Public Shared ReadOnly Property BritishThermalUnits As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ BritishThermalUnits {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace